In [1]:
import pandas as pd

In [7]:
df = pd.read_csv(r"C:\Users\Kishlay Kumar\Documents\doc1.csv")

In [8]:
df

         My_City My_Gender  My_Population
0       New York      Male        4125000
1       New York    Female        4300000
2    Los Angeles      Male        1985000
3    Los Angeles    Female        2070000
4        Phoenix      Male       99800000
5        Chicago      Male        1350000
6        Chicago    Female        1400000
7        Houston      Male        1100000
8        Houston    Female        1120000
9        Phoenix      Male         800000
10       Phoenix    Female         810000
11  Philadelphia      Male         750000
12  Philadelphia    Female         770000
13      New York      Male       99125000
14       Phoenix      Male       99800000

In [11]:
df['My_Population'].max()

319305000

In [19]:
males_in_city = df[df['My_Gender'] == 'Male']

In [20]:
males_in_city

         My_City My_Gender  My_Population
0       New York      Male        4125000
2    Los Angeles      Male        1985000
4        Phoenix      Male       99800000
5        Chicago      Male        1350000
7        Houston      Male        1100000
9        Phoenix      Male         800000
11  Philadelphia      Male         750000
13      New York      Male       99125000
14       Phoenix      Male       99800000

In [21]:
females_ = df[df['My_Gender'] == 'Female']

In [23]:
females_

         My_City My_Gender  My_Population
1       New York    Female        4300000
3    Los Angeles    Female        2070000
6        Chicago    Female        1400000
8        Houston    Female        1120000
10       Phoenix    Female         810000
12  Philadelphia    Female         770000

In [30]:
total_male_population = males_in_city.groupby('My_City')['My_Population'].sum()

In [31]:
total_male_population

My_City
Chicago           1350000
Houston           1100000
Los Angeles       1985000
New York        103250000
Philadelphia       750000
Phoenix         200400000
Name: My_Population, dtype: int64

In [40]:
max_population = total_male_population.max()

In [41]:
city_name = total_male_population.idxmax()

In [42]:
print("city name :" , city_name, 'city_population = ',  max_population)

city name : Phoenix city_population =  200400000

In [52]:
total_male_population.sort_values(ascending = False).head(3)

My_City
Phoenix        200400000
New York       103250000
Los Angeles      1985000
Name: My_Population, dtype: int64